Revit 2027 API
ParameterTypeId.StructuralSectionCommonAlpha Property
 "Principal Axes Angle"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionCommonAlpha { get; }
Public Shared ReadOnly Property StructuralSectionCommonAlpha As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionCommonAlpha {
	ForgeTypeId^ get ();
}
static member StructuralSectionCommonAlpha : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace